OlivierC-FR/ESP32-INAV-Radar/src/main.cpp
const byte interruptPin = 0;
volatile int interruptCounter = 0;
int numberOfInterrupts = 0;

portMUX_TYPE mux = portMUX_INITIALIZER_UNLOCKED;

void IRAM_ATTR handleInterrupt() {
    portENTER_CRITICAL_ISR(&mux);

    if (sys.io_button_pressed == 0) {
        sys.io_button_pressed = 1;

        if (sys.phase > MODE_LORA_SYNC) {
            sys.display_page++;
        }
        else if (sys.phase == MODE_HOST_SCAN) {
            sys.io_bt_enabled = 1; // Enable the Bluetooth if button pressed during host scan
        }

/*
        else if (sys.phase == MODE_MENU) {
            sys.menu_line++;
            sys.menu_begin = millis();
            display.clear();
            if (sys.menu_line > 3) {
                sys.menu_line = 0;
            }
        }
*/
        sys.io_button_released = millis();
    }
    portEXIT_CRITICAL_ISR(&mux);
}

// ----------------------------- setup

void setup() {

    sys.phase = MODE_START;

    config_init();

    sys.lora_cycle = cfg.lora_nodes_max * cfg.lora_slot_spacing;
    sys.cycle_stats = sys.lora_cycle * 2;

    pinMode(IO_LED_PIN, OUTPUT);
    sys.io_led_blink = 0;

    if (cfg.display_enable) {
        display_init();
        display_logo();
        display.clear();
        display.display();
    }

    msp.begin(Serial1);
    Serial1.begin(SERIAL_SPEED, SERIAL_8N1, SERIAL_PIN_RX , SERIAL_PIN_TX);
    reset_peers();

    pinMode(interruptPin, INPUT);
    sys.io_button_pressed = 0;
    attachInterrupt(digitalPinToInterrupt(interruptPin), handleInterrupt, RISING);

    /*
    sys.display_updated = 0;
    sys.menu_line = CFG_PROFILE_DEFAULT;
    sys.menu_line = 1; // ---------------------
    sys.menu_begin = millis();
    sys.phase = MODE_MENU;
    */

    lora_init();

    if (cfg.display_enable) {
        display.clear();
        display.setFont(ArialMT_Plain_10);
        display.drawString(0, 0, "RADAR VERSION ");
        display.setFont(ArialMT_Plain_16);
        display.drawString(100, 0, String(VERSION));
        display.setFont(ArialMT_Plain_10);
        display.drawString(0, 9, String(cfg.profile_name));
        display.drawString(0, 18, "HOST");
        display.display();
    }

    sys.cycle_scan_begin = millis();
    sys.now = millis();
    curr.host = HOST_NONE;
    sys.phase = MODE_HOST_SCAN;
}

// ----------------------------------------------------------------------------- MAIN LOOP

void loop() {

    sys.now = millis();

// ---------------------- IO BUTTON

    if ((sys.now > sys.io_button_released + 150) && (sys.io_button_pressed == 1)) {
        sys.io_button_pressed = 0;
    }

// ---------------------- HOST SCAN

    if (sys.phase == MODE_HOST_SCAN) {

        if ((sys.now > (sys.cycle_scan_begin + HOST_MSP_TIMEOUT)) || (curr.host != HOST_NONE)) {  // End of the host scan

            if (curr.host != HOST_NONE) {
                msp_get_name();
            }

            if (curr.name[0] == '\0') {
                for (int i = 0; i < 3; i++) {
                curr.name[i] = (char) random(65, 90);
                curr.name[3] = 0;
            }
        }

        curr.gps.fixType = 0;
        curr.gps.lat = 0;
        curr.gps.lon = 0;
        curr.gps.alt = 0;
        curr.id = 0;

        LoRa.sleep();
        LoRa.receive();

        if (cfg.display_enable) {
            if (curr.host != HOST_NONE) {
                display.drawString (35, 18, String(host_name[curr.host]) + " " + String(curr.fcversion.versionMajor) + "."  + String(curr.fcversion.versionMinor) + "." + String(curr.fcversion.versionPatchLevel));
                display.drawString (0, 27, "SERIAL SPD "+ String(SERIAL_SPEED));
            } else {
                display.drawString (35, 18, String(host_name[curr.host]));
            }
            if (sys.io_bt_enabled) {
                display.drawString (105, 18, "+BT");
            }
            display.drawProgressBar(0, 51, 40, 8, 100);
            display.drawString (0, 36, "SCAN");
            display.display();
        }

        sys.cycle_scan_begin = millis();
        sys.phase = MODE_LORA_INIT;

        }
        else { // Still scanning
            if (sys.now > sys.display_updated + DISPLAY_CYCLE / 2) {
                delay(100);
                msp_set_fc();

                if (cfg.display_enable) {
                    display.drawProgressBar(0, 53, 40, 6, 100 * (millis() - sys.cycle_scan_begin) / HOST_MSP_TIMEOUT);
                    display.display();
                }
                sys.display_updated = millis();
            }
        }
    }

// ---------------------- LORA INIT

    if (sys.phase == MODE_LORA_INIT) {

        if (sys.now > (sys.cycle_scan_begin + LORA_CYCLE_SCAN)) {  // End of the scan, set the ID then sync

            if(sys.io_bt_enabled) {
                SerialBT.begin((String)"ESP32");
            }

            sys.num_peers = count_peers();
            if (sys.num_peers >= cfg.lora_nodes_max || curr.host == HOST_GCS) { // Too many nodes already, or connected to a ground station : go silent mode
                sys.lora_no_tx = 1;
            } else {
                sys.lora_no_tx = 0;
                pick_id();
            }
            sys.display_page = 0;
            sys.phase = MODE_LORA_SYNC;
        }
        else { // Still scanning

            if (sys.now > sys.display_updated + DISPLAY_CYCLE / 2 && cfg.display_enable) {
                for (int i = 0; i < cfg.lora_nodes_max; i++) {
                    if (peers[i].id > 0) {
                        display.drawString(40 + peers[i].id * 8, 36, String(peer_slotname[peers[i].id]));
                    }
                }
                display.drawProgressBar(40, 51, 86, 8, 100 * (millis() - sys.cycle_scan_begin) / LORA_CYCLE_SCAN);
                display.display();
                sys.display_updated = millis();
            }
        delay(20);
        }
    }

// ---------------------- LORA SYNC

    if (sys.phase == MODE_LORA_SYNC) {

        if (sys.num_peers == 0 || sys.lora_no_tx) { // Alone or Silent mode, no need to sync
            sys.lora_next_tx = millis() + sys.lora_cycle;
            }
        else { // Not alone, sync by slot
            resync_tx_slot(cfg.lora_timing_delay);
        }

        sys.display_updated = sys.lora_next_tx + sys.lora_cycle - 30;
        sys.stats_updated = sys.lora_next_tx + sys.lora_cycle - 15;
        sys.pps = 0;
        sys.ppsc = 0;
        sys.num_peers = 0;
        stats.packets_total = 0;
        stats.packets_received = 0;
        stats.percent_received = 0;
        digitalWrite(IO_LED_PIN, LOW);
        sys.phase = MODE_LORA_RX;
    }

// ---------------------- LORA RX

