OlivierC-FR/ESP32-INAV-Radar/src/main.cpp
    if ((sys.phase == MODE_LORA_RX) && (sys.now > sys.lora_next_tx)) {

        while (sys.now > sys.lora_next_tx) { // In  case we skipped some beats
            sys.lora_next_tx += sys.lora_cycle;
        }

        if (sys.lora_no_tx) {
            sprintf(sys.message, "%s", "SILENT MODE (NO TX)");
            }
        else {
            sys.phase = MODE_LORA_TX;
        }
        sys.lora_tick++;
    }

// ---------------------- LORA TX

    if (sys.phase == MODE_LORA_TX) {
        if (curr.host == HOST_NONE) {
            curr.gps.lat = 0;
            curr.gps.lon = 0;
            curr.gps.alt = 0;
            curr.gps.groundCourse = 0;
            curr.gps.groundSpeed = 0;
        }
        else if (curr.host == HOST_INAV) {
            msp_get_gps(); // GPS > FC > ESP
        }

        sys.lora_last_tx = millis();
        lora_send();
        stats.last_tx_duration = millis() - sys.lora_last_tx;

        // Drift correction

        if (curr.id > 1) {
            int prev = curr.id - 2;
            if (peers[prev].id > 0) {
                sys.lora_drift = sys.lora_last_tx - peers[prev].updated - cfg.lora_slot_spacing;

                if ((abs(sys.lora_drift) > LORA_DRIFT_THRESHOLD) && (abs(sys.lora_drift) < cfg.lora_slot_spacing)) {
                    sys.drift_correction = constrain(sys.lora_drift, -LORA_DRIFT_CORRECTION, LORA_DRIFT_CORRECTION);
                    sys.lora_next_tx -= sys.drift_correction;
                    sprintf(sys.message, "%s %3d", "TIMING ADJUST", -sys.drift_correction);
                }
            }
        }

        sys.lora_slot = 0;
        sys.msp_next_cycle = sys.lora_last_tx + cfg.msp_after_tx_delay;

        // Back to RX

        LoRa.sleep();
        LoRa.receive();
        sys.phase = MODE_LORA_RX;
    }

// ---------------------- DISPLAY

    if ((sys.now > sys.display_updated + DISPLAY_CYCLE) && sys.display_enable && (sys.phase > MODE_LORA_SYNC) && cfg.display_enable) {
        stats.timer_begin = millis();

        if (sys.num_peers == 0 && sys.display_page == 1)  { // No need for timings graphs when alone
            sys.display_page++;
        }

        if (sys.display_page >= (3 + cfg.lora_nodes_max)) {
            sys.display_page = 0;
        }

        display_draw();
        sys.message[0] = 0;
        stats.last_oled_duration = millis() - stats.timer_begin;
        sys.display_updated = sys.now;
    }

// ---------------------- SERIAL / MSP

    if (sys.now > sys.msp_next_cycle && curr.host != HOST_NONE && sys.phase > MODE_LORA_SYNC && sys.lora_slot < cfg.lora_nodes_max) {
        stats.timer_begin = millis();

        if (sys.lora_slot == 0 && curr.host == HOST_INAV) {

            if (sys.lora_tick % 6 == 0) {
                msp_get_state();
            }

            if ((sys.lora_tick + 1) % 6 == 0) {
                msp_get_fcanalog();
            }

        }

    // msp_send_peer(sys.lora_slot); // ESP > FC > OSD

    // ----------------Send MSP to FC and predict new position for all nodes minus current

        for (int i = 0; i < cfg.lora_nodes_max; i++) {
            if (peers[i].id > 0 && i+1 != curr.id ) {
                peers[i].gps_comp.lat = peers[i].gps.lat;
                peers[i].gps_comp.lon = peers[i].gps.lon;
                peers[i].gps_comp.alt = peers[i].gps.alt; 

                if (peers[i].gps.groundSpeed > 200 && peers[i].gps.lat != 0 && peers[i].gps_pre.lat != 0) { // If speed >2m/s : Compensate the position delay
                     sys.now_sec = millis();
                     int32_t comp_var_lat = peers[i].gps.lat - peers[i].gps_pre.lat;
                     int32_t comp_var_lon = peers[i].gps.lon - peers[i].gps_pre.lon;
                     int32_t comp_var_alt = peers[i].gps.alt - peers[i].gps_pre.alt;
                     int32_t comp_var_dur = 1 + peers[i].updated - peers[i].gps_pre_updated;
                     int32_t comp_dur_fw = (sys.now_sec - peers[i].updated);
                     float comp_ratio = comp_dur_fw / comp_var_dur;

                     peers[i].gps_comp.lat += comp_var_lat * comp_ratio;
                     peers[i].gps_comp.lon += comp_var_lon * comp_ratio;
                     peers[i].gps_comp.alt += comp_var_alt * comp_ratio;                 
                } 
                msp_send_radar(i);
                delay(5);
            }
        }
        stats.last_msp_duration[sys.lora_slot] = millis() - stats.timer_begin;
        sys.msp_next_cycle += cfg.lora_slot_spacing;
        sys.lora_slot++;
    }

// ---------------------- STATISTICS & IO

    if ((sys.now > (sys.cycle_stats + sys.stats_updated)) && (sys.phase > MODE_LORA_SYNC)) {

        sys.pps = sys.ppsc;
        sys.ppsc = 0;

        // Timed-out peers + LQ

        for (int i = 0; i < cfg.lora_nodes_max; i++) {

            if (sys.now > (peers[i].lq_updated +  sys.lora_cycle * 4)) {
                uint16_t diff = peers[i].updated - peers[i].lq_updated;
                peers[i].lq = constrain(peers[i].lq_tick * 4.2 * sys.lora_cycle / diff, 0, 4);
                peers[i].lq_updated = sys.now;
                peers[i].lq_tick = 0;
            }

            if (peers[i].id > 0 && ((sys.now - peers[i].updated) > LORA_PEER_TIMEOUT)) { // Lost for a short time
                peers[i].lost = 1;

                if ((sys.now - peers[i].updated) > LORA_PEER_TIMEOUT_LOST) { // Lost for a long time
                    peers[i].state = 2;
                }
            }
        }

        sys.num_peers_active = count_peers(1);
        stats.packets_total += sys.num_peers_active * sys.cycle_stats / sys.lora_cycle;
        stats.packets_received += sys.pps;
        stats.percent_received = (stats.packets_received > 0) ? constrain(100 * stats.packets_received / stats.packets_total, 0 ,100) : 0;

        // Screen management

        if (!curr.state && !sys.display_enable) { // Aircraft is disarmed = Turning on the OLED
            display.displayOn();
            sys.display_enable = 1;
        }
        else if (curr.state && sys.display_enable) { // Aircraft is armed = Turning off the OLED
            display.displayOff();
            sys.display_enable = 0;
        }
    sys.stats_updated = sys.now;
    }

    // LED blinker

    if (sys.lora_tick % 6 == 0) {
        if (sys.num_peers_active > 0) {
            sys.io_led_changestate = millis() + IO_LEDBLINK_DURATION;
            sys.io_led_count = 0;
            sys.io_led_blink = 1;
        }
    }

    if (sys.io_led_blink && millis() > sys.io_led_changestate) {

        sys.io_led_count++;
        sys.io_led_changestate += IO_LEDBLINK_DURATION;

        if (sys.io_led_count % 2 == 0) {
            digitalWrite(IO_LED_PIN, LOW);
        }
        else {
            digitalWrite(IO_LED_PIN, HIGH);
        }

        if (sys.io_led_count >= sys.num_peers_active * 2) {
            sys.io_led_blink = 0;
        }

    }

}